dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csx.c
    Cy_CapSense_SetClkDivider((uint32_t)context->ptrCommonContext->modCsxClk - 1u, context);

    /* Set all IO states to the default state */
    Cy_CapSense_SetIOsInDefaultState(context);

    /* Enable CSD block interrupt and set interrupt vector to CSX sensing method */
    context->ptrActiveScanSns->ptrISRCallback = &Cy_CapSense_CSXScanISR;

    context->ptrActiveScanSns->mfsChannelIndex = 0u;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXElectrodeCheck
****************************************************************************//**
*
* Check whether electrodes were previously connected using
* the Cy_CapSense_CSXSetupWidgetExt() function and if yes, disconnect them.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXElectrodeCheck(cy_stc_capsense_context_t * context)
{
    if (CY_CAPSENSE_SNS_CONNECTED == context->ptrActiveScanSns->connectedSnsState)
    {
        /* Disconnect all Tx pins */
        Cy_CapSense_CSXDisconnectTxExt(context);
        /* Disconnect all Rx pins */
        Cy_CapSense_CSXDisconnectRxExt(context);
        /* Mark the current sensor as disconnected */
        context->ptrActiveScanSns->connectedSnsState = CY_CAPSENSE_SNS_DISCONNECTED;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXDisableMode
****************************************************************************//**
*
* This function disables CSX mode.
*
* To disable CSX mode, the following tasks are performed:
* 1. Disconnect previous CSX electrode if it has been connected.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXDisableMode(cy_stc_capsense_context_t * context)
{
    /* Disconnect previous CSX electrode if it has been connected */
    Cy_CapSense_CSXElectrodeCheck(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXSetupWidget
****************************************************************************//**
*
* Performs hardware and firmware initialization required for scanning sensors
* in a specific widget using the CSX sensing method. This function requires
* using the Cy_CapSense_CSXScan() function to start scanning.
*
* This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_SetupWidget() function should be used instead.
*
* This function initializes the widgets specific common parameters to perform
* the CSX scanning. The initialization includes the following:
* 1. The CSD_CONFIG register.
* 2. The IDAC register.
* 3. The Sense clock frequency
* 4. The phase alignment of the sense and modulator clocks.
*
* This function does not connect any specific sensors to the scanning hardware
* and neither does it start a scanning process. The Cy_CapSense_CSXScan()
* function must be called after initializing the widget to start scanning.
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status.
*
* This function is called by the Cy_CapSense_SetupWidget() if the
* given widget uses the CSX sensing method.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
* Specifies the ID number of the widget to perform hardware and firmware
* initialization required for scanning sensors in the specific widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXSetupWidget(uint32_t widgetId, cy_stc_capsense_context_t * context)
{
    /* variable to access widget details */
    uint32_t snsClkDivider;
    uint32_t snsClkSrc;
    uint32_t tmpRegVal;

    Cy_CapSense_SwitchSensingMode((uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E, context);
    /*
    * Check whether CSX electrodes were previously connected using
    * Cy_CapSense_CSXSetupWidgetExt and if yes, disconnect them
    */
    Cy_CapSense_CSXElectrodeCheck(context);
    /* Set up widget and its first sensor IDs and pointers to have assess to them after scanning  */
    Cy_CapSense_InitActivePtr(widgetId, 0u, context);
    /* Number of conversion and maxRawCount setup */
    tmpRegVal = (uint32_t)context->ptrActiveScanSns->ptrWdContext->resolution;    
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SEQ_NORM_CNT, tmpRegVal);
    context->ptrActiveScanSns->ptrWdContext->maxRawCount = (uint16_t)tmpRegVal * 
        (context->ptrActiveScanSns->ptrWdContext->snsClk - CY_CAPSENSE_CSX_DEADBAND_CYCLES_NUMBER);

    /* SnsClk setup */
    snsClkDivider = (uint32_t) context->ptrActiveScanSns->ptrWdContext->snsClk;
    
    /* Check divider value */
    if (0u == snsClkDivider)
    {
        snsClkDivider = 1u;
    }
    snsClkSrc = (uint32_t)context->ptrActiveScanSns->ptrWdContext->snsClkSource & (uint32_t)~((uint32_t)CY_CAPSENSE_CLK_SOURCE_AUTO_MASK);
    tmpRegVal = ((snsClkSrc << CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | (snsClkDivider - 1u) |
            CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK | CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_BITS_MSK);
    /* Update reg value with divider and configuration */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SENSE_PERIOD, tmpRegVal);
}

/*******************************************************************************
* Function Name: Cy_CapSense_CSXSetupWidgetExt
****************************************************************************//**
*
* Performs extended initialization for the CSX widget and also performs
* initialization required for a specific sensor in the widget. This function
* requires using the Cy_CapSense_CSXScan() function to initiate a scan.
*
* This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_SetupWidgetExt() function should be used instead.
*
* This function does the same tasks as Cy_CapSense_CSXSetupWidget() and
* also connects a sensor in the widget for scanning. After this function is
* called to initialize a widget and a sensor, the Cy_CapSense_CSXScanExt()
* function must be called to scan the sensor.
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
* Specifies the ID number of the widget to perform hardware and firmware
* initialization required for scanning a specific sensor in a specific widget.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget to perform hardware
* and firmware initialization required for scanning a specific sensor in a
* specific widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXSetupWidgetExt(
                uint32_t widgetId, 
                uint32_t sensorId, 
                cy_stc_capsense_context_t * context)
{
    /* Initialize widget */
    Cy_CapSense_CSXSetupWidget(widgetId, context);

    /* Initialize sensor data structure pointer to appropriate address */
    Cy_CapSense_InitActivePtrSns(sensorId, context);

    /* Connect current sensor`s Tx and Rx IOs for scan 
    * and set flag to indicate that IOs should be disconnected */
    Cy_CapSense_CSXConnectTxExt(context);
    Cy_CapSense_CSXConnectRxExt(context);
}

