dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csx.c
/*******************************************************************************
* Function Name: Cy_CapSense_CSXScan
****************************************************************************//**
*
* This function initiates a scan for the sensors of the widget initialized by
* the Cy_CapSense_CSXSetupWidget() function.
*
* This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_Scan() function should be used instead.
*
* This function performs scanning of all the sensors in the widget configured by
* the Cy_CapSense_CSXSetupWidget() function. It does the following tasks:
* 1. Connects the first sensor of the widget.
* 2. Initializes an interrupt callback function to initialize a scan of the
* next sensors in a widget.
* 3. Starts scanning for the first sensor in the widget.
*
* This function is called by the Cy_CapSense_Scan() if the given
* widget uses the CSX sensing method.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning for example).
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status. The widget must be
* pre-configured by the Cy_CapSense_CSXSetupWidget() function if any other
* widget was previously scanned or any other type of scan functions were used.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXScan(cy_stc_capsense_context_t * context)
{
    Cy_CapSense_InitActivePtrSns(0u, context);
    
    /* Connect electrodes */
    Cy_CapSense_CSXConnectTxExt(context);
    Cy_CapSense_CSXConnectRxExt(context);

    /* Set Start of scan flag */
    Cy_CapSense_SetBusyFlags(context);
    /* Set scope flag */
    context->ptrActiveScanSns->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_ALL_SNS;

    Cy_CapSense_CSXStartSample(context);
}

/*******************************************************************************
* Function Name: Cy_CapSense_CSXScanExt()
****************************************************************************//**
*
* Starts the CSX conversion on the pre-configured sensor. This function requires
* using the Cy_CapSense_CSXSetupWidgetExt() function to set up a
* widget.
*
* This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_ScanExt() function should be used instead.
*
* This function performs single scanning of one sensor in the widget configured
* by the Cy_CapSense_CSXSetupWidgetExt() function. It does the following
* tasks:
* 1. Sets a busy flag in the cy_capsense_context structure.
* 2. Configures the Tx clock frequency.
* 3. Configures the Modulator clock frequency.
* 4. Configures the IDAC value.
* 5. Starts single scanning.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning for example). This
* function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status.
*
* The sensor must be pre-configured by using the
* Cy_CapSense_CSXSetupWidgetExt() prior to calling this function.
* The sensor remains ready for the next scan if a previous scan was triggered
* by using the Cy_CapSense_CSXScanExt() function. In this case, calling
* Cy_CapSense_CSXSetupWidgetExt() is not required every time before the
* Cy_CapSense_CSXScanExt() function. If a previous scan was triggered in
* any other way - Cy_CapSense_Scan(), Cy_CapSense_ScanAllWidgets()
* or Cy_CapSense_RunTuner() - (see the Cy_CapSense_RunTuner() function
* description for more details), the sensor must be pre-configured again by
* using the Cy_CapSense_CSXSetupWidgetExt() prior to calling the
* Cy_CapSense_CSXScanExt() function.
*
* If disconnection of the sensors is required after calling
* Cy_CapSense_CSXScanExt(), the Cy_CapSense_CSXDisconnectTx() and
* Cy_CapSense_CSXDisconnectRx() can be used.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXScanExt(cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    /* Set MFS channel index to 0 */
    ptrActive->mfsChannelIndex = 0u;

    /* Initialize the Active Context pointer with the CH0 context */
    ptrActive->ptrSnsContext = &ptrActive->ptrWdConfig->ptrSnsContext[ptrActive->sensorIndex];
    
    /* Set busy flag and start conversion */
    Cy_CapSense_SetBusyFlags(context);
    /* Set scope flag */
    context->ptrActiveScanSns->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_SGL_SNS;

    Cy_CapSense_CSXStartSample(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXCalibrateWidget
****************************************************************************//**
*
* Calibrates the IDAC values of all the sensors/nodes in a CSX widget to get 
* raw count around the specified target.
*
* This function is obsolete and kept for backward compatibility only. 
* The Cy_CapSense_CalibrateWidget() function should be used instead.
*
* Performs a successive approximation search algorithm to find appropriate
* IDAC values for sensors in the specified widget that provides a raw count
* to the level specified by the target parameter.
*
* This function is available when the CSX Enable IDAC auto-calibration
* parameter is enabled.
*
* \param widgetId
* Specifies the ID number of the CSX widget to calibrate its raw count.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CYRET_SUCCESS - The operation is successfully completed.
* - CYRET_BAD_PARAM - The input parameter is invalid.
* - CYRET_BAD_DATA - The calibration failed and the CapSense may not operate
*   as expected.
* - CYRET_INVALID_STATE - The previous scanning is not completed and the
*   hardware block is busy.
*
*******************************************************************************/
cy_status Cy_CapSense_CSXCalibrateWidget(
                uint32_t widgetId, 
                uint32_t target, 
                cy_stc_capsense_context_t * context)
{
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

