dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_csx.c
/*******************************************************************************
* Function Name: Cy_CapSense_SsCSXStartSample
****************************************************************************//**
*
* Starts scanning for the CSX widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSXStartSample(cy_stc_capsense_context_t * context)
{
    /* Set up IDAC Value */
    Cy_CapSense_CSXSetUpIdacs(context);
        
    /* Clear previous interrupts */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR, CY_CAPSENSE_CSD_INTR_ALL_MSK);
    (void)Cy_CSD_ReadReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR);

    /* Enable interrupt */
    Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR_MASK, CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK);
    
    if(NULL != context->ptrCommonContext->ptrSSCallback)
    {
        context->ptrCommonContext->ptrSSCallback(context->ptrActiveScanSns);
    }

    Cy_CapSense_CSXStartSampleExt(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXConnectRx
****************************************************************************//**
*
* Connects an Rx electrode to the CSX scanning hardware.
*
* This function connects a port pin (Rx electrode) to AMUXBUS-A and sets
* drive mode of the port pin to high-Z in the GPIO_PRT_PCx register.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time when there is only one port pin for an
* electrode for example).
*
* \param rxPtr
* Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
* to be connected to the sensing HW block as an Rx pin.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXConnectRx(
                const cy_stc_capsense_pin_config_t * rxPtr, 
                cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(rxPtr->pcPtr, (uint32_t)rxPtr->pinNumber, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXConnectTx
****************************************************************************//**
*
* Connects a Tx electrode to the CSX scanning hardware.
*
* This function connects a port pin (Tx electrode) to the CSD_SENSE signal.
* It is assumed that drive mode of the port pin is already set to STRONG
* in the HSIOM_PORT_SELx register.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time when there is only one port pin for an
* electrode for example).
*
* \param txPtr
* Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
* to be connected to the sensing HW block as a Tx pin.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXConnectTx(
                const cy_stc_capsense_pin_config_t * txPtr, 
                cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(txPtr->pcPtr, (uint32_t)txPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXDisconnectRx
****************************************************************************//**
*
* Disconnects an Rx electrode from the CSX scanning hardware.
*
* This function disconnects a port pin (Rx electrode) from AMUXBUS_A and
* configures the port pin to the strong drive mode. It is assumed that the
* data register (GPIO_PRTx_DR) of the port pin is already 0.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time when there is only one port pin for
* an electrode for example).
*
* \param rxPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging
* to an Rx pin sensor to be disconnected from the sensing HW block.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXDisconnectRx(
                const cy_stc_capsense_pin_config_t * rxPtr, 
                cy_stc_capsense_context_t * context)
{
    uint32_t interruptState;
    
    Cy_CapSense_SsConfigPinRegisters(rxPtr->pcPtr, (uint32_t)rxPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);

    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_Clr(rxPtr->pcPtr, (uint32_t)rxPtr->pinNumber);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXDisconnectTx
****************************************************************************//**
*
* Disconnects a Tx electrode from the CSX scanning hardware.
*
* This function disconnects a port pin (Tx electrode) from the CSD_SENSE
* signal and configures the port pin to the strong drive mode. It is assumed
* that the data register (GPIO_PRTx_DR) of the port pin is already 0.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time when there is only one port pin for an
* electrode for example).
*
* \param txPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging
* to a Tx pin sensor to be disconnected from the sensing HW block.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXDisconnectTx(
                const cy_stc_capsense_pin_config_t * txPtr, 
                cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(txPtr->pcPtr, (uint32_t)txPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
    Cy_GPIO_Clr(txPtr->pcPtr, (uint32_t)txPtr->pinNumber);
}


